Revit 2027 API
PageOrientationType Enumeration
 An enumerated type listing all Page Orientation types of Print Setting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PageOrientationType
Public Enumeration PageOrientationType
public enum class PageOrientationType
type PageOrientationType
Members
Member name | Value | Description
Auto | 2 |  Auto Page Orientation
Landscape | 1 |  The type of Page Orientation is Landscape
Portrait | 0 |  The type of Page Orientation is Portrait
See Also
Reference
Autodesk.Revit.DB Namespace